app/views/spots/index.html.erb

SELECT  "spot_pictures".* FROM "spot_pictures" WHERE "spot_pictures"."spot_id" = $1 ORDER BY "spot_pictures"."id" ASC LIMIT $2  [["spot_id", 1], ["LIMIT", 1]]
SELECT  1 AS one FROM "spot_pictures" WHERE "spot_pictures"."spot_id" = $1 LIMIT $2  [["spot_id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "spots"
SELECT  "spots".* FROM "spots" LIMIT $1 OFFSET $2  [["LIMIT", 3], ["OFFSET", 0]]
---
    <div class="row">
      <% if spot.spot_pictures.any? %>
        <% path = spot.spot_pictures.first.url %>

SELECT COUNT(*) FROM "likes" WHERE "likes"."spot_id" = $1  [["spot_id", 1]]
---
        <div class='col-xs-12 col-sm-10'><%= spot.description %></div>
        <div class='col-xs-12 col-sm-2'><%= spot.likes.count %>