app/views/profiles/show.html.erb

SELECT  "spot_pictures".* FROM "spot_pictures" WHERE "spot_pictures"."spot_id" = $1 ORDER BY "spot_pictures"."id" ASC LIMIT $2  [["spot_id", 5], ["LIMIT", 1]]
SELECT  1 AS one FROM "spot_pictures" WHERE "spot_pictures"."spot_id" = $1 LIMIT $2  [["spot_id", 5], ["LIMIT", 1]]
SELECT "spots".* FROM "spots" WHERE "spots"."id" = 5
---
          <div class="card">
            <% if like.spot.spot_pictures.any? %>